src/test/resources/xml/example.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <createOrder type="NEW" xmlns="http://order.telco.hsntech.com">
            <account xmlns="">
                <contact>
                    <title>Mr</title>
                    <firstName>Demo</firstName>
                    <lastName>Doan</lastName>
                    <telephoneNumbers defaultContact="daytime">
                        <daytime>0398403850</daytime>
                        <evening>0208619999</evening>
                        <mobile>02086999990</mobile>
                    </telephoneNumbers>
                    <emailAddress>quang@hsntech.com</emailAddress>
                    <birthDate>1975-01-01</birthDate>
                </contact>
                <billingAddress>
                    <buildingIdentifier>6</buildingIdentifier>
                    <addressLine1>LUKIN STREET</addressLine1>
                    <town>LONDON</town>
                    <country>United Kingdom</country>
                    <postcode>E10AA</postcode>
                    <ptc_abs_code>PTCABS3075103</ptc_abs_code>
                    <startDate>1980-08-08</startDate>
                </billingAddress>
                <accountDetail>
                    <username>quangdoan3</username>
                    <password>password3</password>
                    <securityQuestion>Mothers maiden name?</securityQuestion>
                    <securityAnswer>smith</securityAnswer>
                </accountDetail>
                <billingDetail>
                    <billGroupId>1570</billGroupId>
                    <preferredNotification>SMS</preferredNotification>
                    <paymentDetail type="CARD">
                        <creditCard>
                            <cardName>CardName</cardName>
                            <cardNumber>5105105105105100</cardNumber>
                            <cardType>MC</cardType>
                            <cardExpiryDate>1230</cardExpiryDate>
                            <cardStartDate>0110</cardStartDate>
                            <cvv>123</cvv>
                        </creditCard>
                    </paymentDetail>
                    <billFormat>SUMMARY</billFormat>
                    <clubcardNumber>634143330730912784</clubcardNumber>
                </billingDetail>
            </account>
            <verification runCreditCheck="false" termsAndConditionsAccepted="true" xmlns="">
                <interconnect>
                    <param name="PAYASYOUGO"/>
                </interconnect>
            </verification>
            <orderDetail externalSystemID="COCO" devicePrint="DEVICEPRINT-AA" ipAddress="160.206.234.22" orderRef="12345" salesChannel="Onlines" paymentMethod="CARD" xmlns="">
                <dateTime>2011-06-10T00:00:00</dateTime>
                <orderItem dealSKU="DEAL-INHAND" id="1">
                    <serviceRef reference="Mobile Ref 1"/>
                    <tariff productCode="FC12-1000-500SO">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </tariff>
                    <device productCode="SIM-ONLY">
                        <deliveryMethod>DELIVER</deliveryMethod>
                    </device>
                    <discBundle productCode="02000-SB-A" bundleGroup="SB-GRP-A">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </discBundle>
                </orderItem>
                <paymentRequest>
                    <cardName>CardName</cardName>
                    <cardNumber>5105105105105100</cardNumber>
                    <cardType>MC</cardType>
                    <cardExpiryDate>1230</cardExpiryDate>
                    <cardStartDate>0110</cardStartDate>
                    <cvv>123</cvv>
                </paymentRequest>
            </orderDetail>
        </createOrder>
    </s:Body>
</s:Envelope>